import { MigrationInterface, QueryRunner } from "typeorm";

export class AddEmployeeTypes1742144482289 implements MigrationInterface {
    public async up(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query(`
            INSERT INTO employee_type (name_ar) VALUES 
            ('رئيس مجلس الإدارة'),
            ('مدير عام الشركة'),
            ('مدير الادارة المالية'),
            ('مديرة الموارد البشرية'),
            ('مسئول موارد بشرية'),
            ('محاسب اول'),
            ('منسق إدارة التطوير'),
            ('مندوب مشتريات'),
            ('مدخل بيانات'),
            ('مدير إدارة التطوير'),
            ('عامل نظافة'),
            ('مدير موقع'),
            ('مهندس ميكانيكى'),
            ('مساعد'),
            ('فنى سمكري سيارات'),
            ('فنى إطارات'),
            ('فني تبريد وتكييف سيارات'),
            ('فنى كهربائي سيارات'),
            ('ميكانيكى معدات ثقيلة'),
            ('ميكانيكى معدات خفيفة'),
            ('سائق فوركلفت'),
            ('سائق درجة أولى'),
            ('وناش'),
            ('صبانى بحرى'),
            ('سائق مان ليفت'),
            ('سائق درجة ثانية'),
            ('فني دوكو'),
            ('مسئول تشغيل'),
            ('مهندس لفتينج'),
            ('مسؤول مخازن'),
            ('مدير ادارة العمليات'),
            ('منسق ادارة العمليات'),
            ('محاسب'),
            ('صبانى'),
            ('فني تشحيم'),
            ('مهندس صيانة'),
            ('مهندس سلامه وصحه مهنية( سيفتى)'),
            ('بانكس مان'),
            ('عامل 5%'),
            ('مسئولة المرتبات');
        `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query(`
            DELETE FROM employee_type 
            WHERE type IN (
                'رئيس مجلس الإدارة',
                'مدير عام الشركة',
                'مدير الادارة المالية',
                'مديرة الموارد البشرية',
                'مسئول موارد بشرية',
                'محاسب اول',
                'منسق إدارة التطوير',
                'مندوب مشتريات',
                'مدخل بيانات',
                'مدير إدارة التطوير',
                'عامل نظافة',
                'مدير موقع',
                'مهندس ميكانيكى',
                'مساعد',
                'فنى سمكري سيارات',
                'فنى إطارات',
                'فني تبريد وتكييف سيارات',
                'فنى كهربائي سيارات',
                'ميكانيكى معدات ثقيلة',
                'ميكانيكى معدات خفيفة',
                'سائق فوركلفت',
                'سائق درجة أولى',
                'وناش',
                'صبانى بحرى',
                'سائق مان ليفت',
                'سائق درجة ثانية',
                'فني دوكو',
                'مسئول تشغيل',
                'مهندس لفتينج',
                'مسؤول مخازن',
                'مدير ادارة العمليات',
                'منسق ادارة العمليات',
                'محاسب',
                'صبانى',
                'فني تشحيم',
                'مهندس صيانة',
                'مهندس سلامه وصحه مهنية( سيفتى)',
                'بانكس مان',
                'عامل 5%',
                'مسئولة المرتبات'
            );
        `);
    }
}
